Repository: franck-paul/socialShare
Catalog: locales/*/main.po
Languages: fr

source: Add social networks sharing buttons to your posts and pages
fr: Ajoute les boutons de partage des réseaux sociaux à vos publications

source: (new window)
fr: (nouvelle fenêtre)

source: Share this on Twitter/X
fr: Partager ceci sur Twitter/X

source: Share this on Facebook
fr: Partager sur Facebook

source: Share this on LinkedIn
fr: Partager sur LinkedIn

source: Share this on Mastodon
fr: Partager sur Mastodon

source: Share this on Bluesky
fr: Partager sur Bluesky

source: Share this by mail
fr: Partager ce document par mail

source: Share menu
fr: Menu de partage

source: Share this entry:
fr: Partager cette publication :

source: Use default CSS styles
fr: Utiliser les styles CSS par défaut

source: Use theme's CSS styles
fr: Utiliser les styles CSS définis dans le thème du blog

source: Use user-defined styles
fr: Utiliser des styles CSS personnalisés

source: Activate socialShare plugin
fr: Activer le plugin socialShare

source: Buttons
fr: Boutons

source: Add Twitter/X sharing button
fr: Ajoute le bouton de partage vers Twitter/X

source: Twitter/X account:
fr: Compte Twitter/X :

source: This will be used as "via" in tweet rather than the blog name (if not empty).
fr: Sera utilisé dans le "via" du tweet plutôt que le nom du blog (si non vide).

source: Add Facebook sharing button
fr: Ajoute le bouton de partage vers Facebook

source: Add LinkedIn sharing button
fr: Ajoute le bouton de partage vers LinkedIn

source: Add Mastodon sharing button
fr: Ajoute le bouton de partage vers Mastodon

source: Add Bluesky sharing button
fr: Ajoute le bouton de partage vers Bluesky

source: Add Mail sharing button
fr: Ajoute le bouton de partage par email

source: Add a button for the browser's share menu
fr: Ajouter un bouton pour le menu de partage du navigateur

source: This button may not be available depending on your browser capabilities and settings.
fr: Ce bouton peut ne pas être disponible en fonction des capacités et des paramètres de votre navigateur.

source: Add social sharing buttons on posts
fr: Ajoute les boutons de partage pour les billets

source: Add social sharing buttons on pages
fr: Ajoute les boutons de partage pour les pages

source: Add social sharing buttons only on single display (post or page)
fr: Ajoute les boutons de partage uniquement dans l'affichage de billet (ou de page) seul

source: Automatically add social sharing buttons before content
fr: Insérer automatiquement les boutons de partage avant le contenu

source: Automatically add social sharing buttons after content
fr: Insérer automatiquement les boutons de partage après le contenu

source: Add social sharing buttons using template tag
fr: Insérer les boutons de partage en utilisant la balise template

source: The {{tpl:SocialShare}} template tag must be present in your template's file(s).
fr: La balise {{tpl:SocialShare}} doit être présente dans vôtre/vos fichier(s) template.

source: Advanced options
fr: Options avancées

source: Social sharing buttons text prefix:
fr: Insérer le texte suivant devant les boutons de partage :

source: This will be inserted before buttons (if not empty).
fr: Sera inséré devant les boutons si non vide.

source: Title introduction text:
fr: Texte d'introduction devant le titre :

source: This will be inserted before title (if not empty).
fr: Sera inséré devant le titre de la publication si non vide.

source: Use tags if any
fr: Utiliser les mot-clés s'ils existent

source: Only for Twitter/X, Bluesky and Mastodon buttons.
fr: Uniquement pour les boutons Twitter/X, Bluesky et Mastodon.

source: Social sharing buttons CSS styles
fr: Styles CSS à appliquer

source: User defined CSS styles:
fr: Styles CSS personnalisés :

source: See the README.md file for HTML markup and example of CSS styles.
fr: Voir le fichier README.md pour le balisage HTML et un exemple de styles CSS.

source: Save
fr: Enregistrer
